---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMassing
source: html/7d433675-6fd2-307b-7270-4f00f6dcb273.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMassing Property

A massing cannot be copied. Copy the elements within the massing instead.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyMassing { get; }
```